ShadowIntensity Property
 The intesity of cast shadows - 0 = no shadows, 100 = black.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int ShadowIntensity { get; set; }
Visual Basic
Public Property ShadowIntensity As Integer
	Get
	Set
Visual C++
public:
property int ShadowIntensity {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  When setting this property: The value is invalid. The valid range is 0 through 100
Autodesk.Revit.ExceptionsInvalidOperationException |  When setting this property: This view does not contain display-related properties.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →